*수술전 약물준비 섹션
-마취 유도제 섹션안에 서브섹션으로 있는 마취 유도제 – 이름을 도입마취 로 변경
1) 알팍산은 도입마취 서브섹션 안의 약물로서 현재의 계산식으로 결과를 기록한다.
2) 프로포폴 주사제를 추가하는데 용량은 아래의 계산식을 참고하여 알팍산 항목처럼 최소 최     대 용량을 제시한다.
최소 추천 용량: 2 mg/kg
최대 추천 용량: 6 mg/kg 
필요 용량(mL) 계산식:

주입할 용량 (mL)= 
10 (mg/mL)
환자 체중 (kg)×선택한 용량 (mg/kg)
​
 
예시:
4kg 환자에게 4 mg/kg 용량을 적용할 경우:

주입할 용량 (mL)= 
10 mg/mL
4 kg×4 mg/kg
​
 =1.6 mL

이 경우, 총 1.6mL를 주사기에 준비하여 효과를 보면서 나누어 주입합니다.

위의 계산식 과 최소 최대 용량을 참고하여 사용자가 선택한 몸무게와 연동되어 자동으로 기록되게 한다.
3) 추가 로직으로 사용자가 환자의 정보선택에서 심장이상을 선택하면 알팍산에 붉은색 하이라이트로 추천하여 사용자가 심장이상의 환자에서 알팍산으로 더 고려할수 있게 하는 로직을 추가 한다.
